<div class="container pb-5 mb-5 content position-relative">
    <h1 class="text-center mb-5">Руководителю</h1>
    <div class="row">
        <div class="col-lg-3 d-lg-block d-none">
            <a class="help-back-btn" href="/ru/help/"><i class="fas fa-arrow-left"></i></a>
            <div id="tocBar" class="pl-3 toc-bar position-absolute"></div>
        </div>
        <div class="col-12 col-lg-9 toc-content">
            <div>
                <h3 id="company">Компания</h3>
                <p>Состоит из двух блоков: “информация о компании” и “список сотрудников”</p>
                <p>Блок “Информация о компании” отображает название компании, текущий тип аккаунта(premium или стандартный), описание и сайт.</p>
                <p>В блоке “Список сотрудников” приведены все сотрудники компании и текущая статистика по задачам за текущий месяц.</p>
                <p>Сео имеет возможность уволить сотрудника по нажатию на иконку “Уволить сотрудника” немного правее статистики по задачам. Уволенные сотрудники переходят в раздел списка “Уволенные сотрудники”, для восстановления сотрудника нужно нажать на соответствующую иконку  - "восстановить".</p>
                <h4 id="companySettings">Настройка компании</h4>
                <p>Для изменения наименования компании(сокращенное до 8-ми символов), полное названия, описания, веб-сайта и часового пояса необходимо нажать на “шестеренку” в правом верхнем углу на странице "Компания". Подтвердить изменения необходимо кнопкой “Сохранить изменения компании”.</p>
                <h4 id="staffInvitation">Приглашение сотрудников</h4>
                <p>Сео доступна функция приглашения новых сотрудников в компанию, для попадания на страницу приглашения достаточно нажать на “Пригласить сотрудников”.</p>
                <p>Страница приглашения состоит из блока отправки приглашения и списка уже отправленных.</p>
                <p>Блок отправки приглашения - тут возможно приглашать сотрудников, email которых ранее не использовался в системе. Чтобы пригласить достаточно ввести нужную почту сотрудника и подтвердить нажатием на “Отправить”. Если этот email уже использовался вы получите уведомление об этом под кнопкой “Отправить”.</p>
                <p>Блок отправленных приглашений представляет из себя список приглашений, состоящих из email’а, даты отправки и статуса приглашения (отправлено или зарегистрирован). Если приглашение было отправлено по ошибке, а человек по нему еще не зарегистрировался, приглашение возможно отменить по нажатию на соответствующую кнопку рядом с текущим статусом. Зарегистрированные пользователи в системе по вашему приглашению отображаются со статусом “Зарегистрирован”.</p>
                <h3 id="report">Отчеты</h3>
                <p>Страница “Отчеты” доступна только для сео. Есть 2 типа: отчет по компании и отчет по сотруднику. При попадании на страницу “Отчеты” автоматически строится отчет по компании за текущий месяц.</p>
                <h4 id="reportCompany">Отчет по компании</h4>
                <p>Для построения отчета по компании, необходимо выбрать нужный период в соответствующих полях, а также тип отчета и подтвердить действие по клику на кнопку “Построить отчет”.</p>
                <p>В блоке “Статистика событий” приводится чарт с событиями за выбранный период, количество всех событий, созданных, выполненных, просроченных, перенесенных и отмененных.</p>
                <p>Блок “Статистика по сотрудникам” - в этом блоке отображена активность каждого сотрудника за выбранных период, его количество выполненных, порученных, просроченных и перенесенных задач.</p>
                <p>Блок  “Задачи” показывает текущий статус задач за выбранный период.</p>
                <h4 id="reportStaff">Отчет по сотруднику</h4>
                <p>Для построения отчета по сотруднику необходимо в выпадающем списке “Тип отчета” выбрать соответствующую позицию и указать нужный период. Далее остается определить нужного сотрудника в выпадающем меню и нажать на кнопку “Построить отчет”.</p>
                <p>Блок “Статистика по сотруднику” показывает информацию по сотруднику за выбранный ранее период, его количество выполненных, порученных, просроченных и перенесенных задач.</p>
                <p>Блок  “Задачи” показывает текущий статус задач за выбранный период.</p>
                <h3 id="partnership">Партнерство</h3>
                <p>Вы можете рассказывать о Lusy.io своим друзьям, пересылая им сгенерированные ссылки для регистрации или бесплатные промокоды на Premium-функционал. Благодаря этим вещам, мы сможем отследить от кого пришел человек и вознаградить и Вас и его.</p>
                <p>За каждую компанию вы получаете бонусные дни premium доступа только после ее подтверждения системой, а сама эта компания получает их сразу же.</p>
                <p>В блоке “Статистика” вы можете проверить сколько ваших компаний-друзей присоединилось по вашей ссылке или промокоду, сколько из них ожидает подтверждение активности системой, а сколько уже это подтверждение получили.</p>
                <p>Блок “Прогресс достижения вечного premium доступа”, в нем можно отследить, сколько еще осталось позвать друзей для получения заветного premium доступа.</p>
                <p>Получить различные рекламные материалы и почитать подробнее о партнерской программе можно на странице <a href="/ru/partners/">партнерство</a>.</p>
            </div>
        </div>
    </div>
</div>
<script src="https://cdnjs.cloudflare.com/ajax/libs/tocbot/4.4.2/tocbot.min.js"></script>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/tocbot/4.4.2/tocbot.css">
<script>
    tocbot.init({

        // Where to render the table of contents.
        tocSelector: '.toc-bar',
        // Where to grab the headings to build the table of contents.
        contentSelector: '.toc-content',
        // Which headings to grab inside of the contentSelector element.
        headingSelector: 'h1, h2, h3, h4',
        // For headings inside relative or absolute positioned containers within content.
        hasInnerContainers: true,
        positionFixedSelector: '.toc-bar',
        includeHtml: true,
        orderedList: false,
        collapseDepth: 6,
        fixedSidebarOffset: $('.toc-bar').offset().top,
    });
</script>
