<div class="main">
    <div class="container">
        <div class="row justify-content-sm-center">
            <div class="col-sm-8 text-center">
                <p class="lead-text">Освободите место для великих свершений</p>
                <h1>Lusy.io - система постановки и контроля задач</h1>
                <a href="https://s.lusy.io/reg/" class="btn btn-primary mt-3">Начать пользоваться</a>
            </div>
            <div class="col-sm-12">
                <img class="w-100" src="/public/images/lusy.jpg">
            </div>
        </div>
    </div>
</div>
<div class="second pt-5 pb-5">
    <div class="container">
        <div class="row">
            <div class="col-sm-12 d-none">
                Ваша компания будет расти, только если вы будете думать о ее развитии. Погружаясь в рутину, нет
                движения. Можно покзаать путь к решение рутины - шаг первый это внедрить систему управления зарегав
                сотрудников. Второй шаг - постановка задач и контроль сроков - теперь голова свободна. Учет событий
                мотивация - люди работают вы спокойны и движетесь вперед. В итоге вы имеет контроль над процессами в
                телефоне, не думаете о напоминаии сортудникам и ваш взор направлен вперед, где вашу команию ждет успех.
            </div>
        </div>
    </div>
</div>

<div class="container-small pt-5 pb-5">
    <div class="text-center">
        <h1 class="functions-title">Сильная основа для устойчивого роста 💪</h1>
        <p class="functions-content">Тут можно что-то делать и что-то будет</p>
    </div>
</div>
<div class="container pb-5">
    <ul class="items">
        <li class="item">
            <div>
                <h3 class="item-title">
                    <img class="item-title-icon">
                    <span class="item-title-text">
                        Функция 1
                    </span>
                </h3>
                <p class="item-content">
                    <span class="item-content-text">Второй шаг - постановка задач и контроль сроков - теперь голова свободна. Учет
                    событий мотивация - люди ра
                    </span>
                </p>
            </div>
        </li>
        <li class="item">
            <div>
                <h3 class="item-title">
                    <img class="item-title-icon">
                    <span class="item-title-text">
                        Функция 2
                    </span>
                </h3>
                <p class="item-content">
                    <span class="item-content-text">Второй шаг - постановка задач и контроль сроков - теперь голова свободна. Учет
                    событий мотивация - люди ра
                    </span>
                </p>
            </div>
        </li>
        <li class="item">
            <div>
                <h3 class="item-title">
                    <img class="item-title-icon">
                    <span class="item-title-text">
                        Функция 3
                    </span>
                </h3>
                <p class="item-content">
                    <span class="item-content-text">Второй шаг - постановка задач и контроль сроков - теперь голова свободна. Учет
                    событий мотивация - люди ра
                    </span>
                </p>
            </div>
        </li>
        <li class="item">
            <div>
                <h3 class="item-title">
                    <img class="item-title-icon">
                    <span class="item-title-text">
                        Функция 1
                    </span>
                </h3>
                <p class="item-content">
                    <span class="item-content-text">Второй шаг - постановка задач и контроль сроков - теперь голова свободна. Учет
                    событий мотивация - люди ра
                    </span>
                </p>
            </div>
        </li>
        <li class="item">
            <div>
                <h3 class="item-title">
                    <img class="item-title-icon">
                    <span class="item-title-text">
                        Функция 2
                    </span>
                </h3>
                <p class="item-content">
                    <span class="item-content-text">Второй шаг - постановка задач и контроль сроков - теперь голова свободна. Учет
                    событий мотивация - люди ра
                    </span>
                </p>
            </div>
        </li>
        <li class="item">
            <div>
                <h3 class="item-title">
                    <img class="item-title-icon">
                    <span class="item-title-text">
                        Функция 3
                    </span>
                </h3>
                <p class="item-content">
                    <span class="item-content-text">Второй шаг - постановка задач и контроль сроков - теперь голова свободна. Учет
                    событий мотивация - люди ра
                    </span>
                </p>
            </div>
        </li>
    </ul>
</div>

<div class="second pt-5 pb-5">
    <div class="container-small text-center pb-5">
        <h1 class="pricing-title">Сколько это стоит?</h1>
        <p class="pricing-content">2 тарифа с человеческим объяснением ценообразования</p>
    </div>
    <div class="container">
        <div class="row justify-content-around">
            <div class="col-xl-4 col-md-6">
                <div class="price">
                    <div class="price-title">
                        <p>Бесплатный</p>
                        <sup>$</sup> 00 <sub>в месяц</sub>
                    </div>
                    <div class="price-content">
                        <ul>
                            <li>100 мб хранилища</li>
                            <li>Доступ к основному функционалу</li>
                            <li>что-то еще</li>
                            <li>что-то еще</li>
                        </ul>
                    </div>
                    <div class="price-footer">
                        <a class="btn btn-outline-primary">Регистрация</a>
                    </div>
                </div>
            </div>
            <div class="col-xl-4 col-md-6">
                <div class="price">
                    <div class="price-title">
                        <p>Платный</p>
                        <sup>$</sup> 50 <sub>в месяц</sub>
                    </div>
                    <div class="price-content">
                        <ul>
                            <li>еще больше хранилище</li>
                            <li>еще больше контента</li>
                            <li>что-то еще</li>
                            <li>что-то еще</li>
                        </ul>
                    </div>
                    <div class="price-footer">
                        <a class="btn btn-outline-primary">Регистрация</a>
                    </div>
                </div>
            </div>
        </div>
    </div>
</div>

<div class="container-small pt-5 pb-5 text-center">
    <h1 class="about-title">Вы спрашиваете - мы отвечаем 💬</h1>
    <p class="about-content">Тут вопросики</p>
</div>
<div class="container pb-5">
    <div class="about-container">
        <ul class="about-list">
            <li class="about-item">
                <img class="about-icon" src="/public/images/about-icon.svg">
                <h2 class="about-question-title">Что такое LUSY?</h2>
                <div class="about-question-content">
                    <p class="about-content">Ваша компания будет расти, только если вы будете думать о ее развитии.
                        Погружаясь в рутину, нет
                        движения. Можно покзаать путь к решение рутины - шаг первый это внедрить систему управления
                        зарегав
                        сотрудников. Второй шаг - постановка задач и контроль сроков - теперь голова свободна. Учет
                        событий
                        мотивация - люди работают вы спокойны и движетесь вперед. В итоге вы имеет контроль над
                        процессами в
                        телефоне, не думаете о напоминаии сортудникам и ваш взор направлен вперед, где вашу команию ждет
                        успех.</p>
                </div>
            </li>
            <li class="about-item">
                <img class="about-icon" src="/public/images/about-icon.svg">
                <h2 class="about-question-title">Что такое LUSY?</h2>
                <div class="about-question-content">
                    <p class="about-content">Ваша компания будет расти, только если вы будете думать о ее развитии.
                        Погружаясь в рутину, нет
                        движения. Можно покзаать путь к решение рутины - шаг первый это внедрить систему управления
                        зарегав
                        сотрудников. Второй шаг - постановка задач и контроль сроков - теперь голова свободна. Учет
                        событий
                        мотивация - люди работают вы спокойны и движетесь вперед. В итоге вы имеет контроль над
                        процессами в
                        телефоне, не думаете о напоминаии сортудникам и ваш взор направлен вперед, где вашу команию ждет
                        успех.</p>
                </div>
            </li>
        </ul>
        <ul class="about-list">
            <li class="about-item">
                <img class="about-icon" src="/public/images/about-icon.svg">
                <h2 class="about-question-title">Что такое LUSY?</h2>
                <div class="about-question-content">
                    <p class="about-content">Ваша компания будет расти, только если вы будете думать о ее развитии.
                        Погружаясь в рутину, нет
                        движения. Можно покзаать путь к решение рутины - шаг первый это внедрить систему управления
                        зарегав
                        сотрудников. Второй шаг - постановка задач и контроль сроков - теперь голова свободна. Учет
                        событий
                        мотивация - люди работают вы спокойны и движетесь вперед. В итоге вы имеет контроль над
                        процессами в
                        телефоне, не думаете о напоминаии сортудникам и ваш взор направлен вперед, где вашу команию ждет
                        успех.</p>
                </div>
            </li>
            <li class="about-item">
                <img class="about-icon" src="/public/images/about-icon.svg">
                <h2 class="about-question-title">Что такое LUSY?</h2>
                <div class="about-question-content">
                    <p class="about-content">Ваша компания будет расти, только если вы будете думать о ее развитии.
                        Погружаясь в рутину, нет
                        движения. Можно покзаать путь к решение рутины - шаг первый это внедрить систему управления
                        зарегав
                        сотрудников. Второй шаг - постановка задач и контроль сроков - теперь голова свободна. Учет
                        событий
                        мотивация - люди работают вы спокойны и движетесь вперед. В итоге вы имеет контроль над
                        процессами в
                        телефоне, не думаете о напоминаии сортудникам и ваш взор направлен вперед, где вашу команию ждет
                        успех.</p>
                </div>
            </li>
        </ul>
    </div>
</div>

<div class="second pt-5 pb-5">
    <div class="container text-center">
        <h1>Письмо от основателя</h1>
        <p>Перечень функций</p>
    </div>
</div>


<div class="container-small pt-5 pb-5 text-center">
    <h1 class="blog-title">Знания</h1>
    <p class="blog-content">Блоги</p>
</div>
<div class="container blog-list pb-5">
    <div class="row">
        <?php foreach ($articles as $article): ?>
            <div class="col-sm-4">
                <a href="/<?= $article['language']; ?>/blog/<?= $article['url']; ?>">
                    <div class="article mb-3">
                        <img src="/public/<?php if (!empty($article['img_small'])) {
                            echo 'upload/' . $article['img_small'];
                        } else {
                            echo 'images/default_small.jpg';
                        } ?>" title=" <?= $article['article_name']; ?>">
                        <div class="articleinside">
                            <h2 class="blog-text-title">
                                <?= $article['article_name']; ?>
                            </h2>
                            <div class="blog-info">
                                <?= mb_substr($article['description'], 0, 80); ?>...
                            </div>
                        </div>
                        <hr>
                        <div class="articlefot text-secondary">
                            <?= $article['category'] . ' | ' . date("d.m.Y", $article['publish_date']); ?>
                        </div>
                    </div>
                </a>
            </div>
        <?php endforeach; ?>
    </div>
    <div class="blog-links">
        <a href="/<?= $this->route['language']; ?>/blog/" class="blog-link">
            <span class="blog-link-text">Узнать больше в блоге</span>
        </a>
    </div>
</div>

<div class="footer">
    <div class="container">
        <div class="footer-content">
            <div class="footer-text">
                © 2019 LUSY
            </div>
        </div>
    </div>
</div>
