<div class="container pb-5">
    <h1 class="text-dark mt-5 pb-5">Стоимость</h1>

    <div class="row mb-5">
        <div class="col-sm-6">
            <div class="card">
                <div class="card-body">
                    <h4 class="mt-1 mb-3">Бесплатный тариф</h4>
                    <p>Здесь есть всё, что необходимо рядовой компании:</p>
                    <p>- Неограниченное количество сотрудников</p>
                    <p>- Общий и индивидуальные чаты</p>
                    <p>- Настраиваемые уведомления на почту</p>
                    <p>- Система достижений</p>
                    <p>- Файловый менеджер (объем 100мб)</p>
                    <p>- Возможность создать до 200 задач в месяц</p>
                </div>
            </div>
        </div>
        <div class="col-sm-6">
            <div class="card">
                <div class="card-body">
                    <h4 class="mt-1 mb-3">Платный тариф - 299 рублей/месяц</h4>
                    <p>- Всё, что есть в бесплатном тарифе</p>
                    <p>- Неограниченное количество задач</p>
                    <p>- Бесшовная интеграция с Google Drive и DropBox + 1гб на нашем сервере</p>
                    <p>- Подробная отчетность о деятельности компании и отдельных сотрудниках</p>
                    <p>- Интеграции с сторонними сервисами, н-р AmoCRM, Яндекс.Метрика и т.д.</p>
                </div>
            </div>
        </div>
    </div>
    <p>Мы не берем оплату за каждого сотрудника, как делают многие другие сервисы. Мы выступаем против этой системы. Мы
        платим за нагрузку на сервер и место на диске, поэтому в бесплатном тарифе вынуждены ограничить вас в месяц 150
        задачами и 100мб диского пространства всего.</p>
    <p>Однако, когда вы перерастете бесплатный тариф и вам захочется большего, мы предоставим вам безлимитный доступ к
        функционалу.</p>
    <p class="mt-3">Оплата тарифного плана происходит путем автоплатежа - автоматического списания
        суммы средств с периодичностью,
        соответствующей выбранному тарифу. Подписку можно отменить в любой момент. Более подробнее читайте в <a
                href="https://lusy.io/licenzionnoe-soglashenie-dogovor-publichnoj-oferty.pdf"
                class="btn-link" target="_blank">Оферте
            рекуррентных
            платежей</a>.</p>
</div>