<div class="container pb-5">
    <h1 class="text-white mt-5 pb-5">Стоимость</h1>

    <div class="row">
        <div class="col-sm-6">
            <div class="card">
                <div class="card-body">
                    <h4 class="mt-1 mb-3">Бесплатный тариф</h4>
                    <p>Здесь есть всё, что необходимо рядовой компании:</p>
                    <p>- Неограниченное количество сотрудников</p>
                    <p>- Общий и индивидуальные чаты</p>
                    <p>- Настраиваемые уведомления на почту</p>
                    <p>- Система достижений</p>
                    <p>- Файловый менеджер (объем 100мб)</p>
                    <p>- Возможность создать до 200 задач в месяц</p>
                </div>
            </div>
        </div>
        <div class="col-sm-6">
            <div class="card">
                <div class="card-body">
                    <h4 class="mt-1 mb-3">Платный тариф - 299 рублей/месяц</h4>
                    <p>- Всё, что есть в бесплатном тарифе</p>
                    <p>- Неограниченное количество задач</p>
                    <p>- Бесшовная интеграция с Google Drive и DropBox + 1гб на нашем сервере</p>
                    <p>- Подробная отчетность о деятельности компании и отдельных сотрудниках</p>
                    <p>- Интеграции с сторонними сервисами, н-р AmoCRM, Яндекс.Метрика и т.д.</p>
                </div>
            </div>
        </div>
    </div>

    <p class="mt-5">Нашей задачей было создать бесплатный тариф с функционалом, который идеально подходит для начинающих
        компаний из 2-4 человек. Однако, мы вынуждены платить за место и нагрузку на сервер - поэтому есть ограничение
        на количество задач в месяц и место на диске.</p>
    <p>Если вы перерастете бесплатный тариф, то в premium-аккаунте мы порадуем вас расширенным функционалом, который
        позволит вывести вашу компанию на новый уровень.</p>
</div>