<?php include 'header.php';?>
<div class="container">
		
<h1>Что такое система канбан &mdash; принципы работы и практические примеры использования</h1>

<p>Канбан &mdash; система управления снабжением и производством, в основе которой лежит концепция визуализации задач. Постановка задач в этой системе осуществляется в виде карточек на доске. Канбан помогает выпускать продукт точно в срок, а также экономить производственные ресурсы.</p>

<p>Главная метрика канбана &mdash; среднее время выполнения задачи. Эта система подходит для ручного производства, а также для небольших команд, которые одновременно единовременно выполняют не более 4-5 задач. Если задач больше, контролировать производственный процесс сложнее.</p>

<h2>Как происходит работа с доской канбан</h2>
<p></p>
<p>В системе производства канбан работа над продуктом делится на несколько этапов. Каждому этапу соответствует отдельная колонка на доске. Последняя колонка &mdash; завершенный продукт. Работники, которые занимаются решением задач из первой колонки, перемещают карточку во вторую колонку после выполнения своей работы. В свою очередь команда, отвечающая за работу над задачами из второй колонки, перемещает карточки в третью. Таким образом работа над продуктом выполняется этап за этапом, пока не достигнет конечной цели.</p>

<p>Особенность системы в том, что количество одновременно выполняемых задач в одной колонке ограничено. Если скопившиеся задачи в одной из колонок тормозят процесс производства, вся команда фокусируется на разгрузке этой колонки. В управлении канбан хорошо выстроены коммуникации между командой, что способствует распространению знаний и опыта между всеми участниками производственного процесса.</p>
<p>Обычно задачи в канбане не оцениваются до начала работы. Это значит, что все метрики отталкиваются от закрытых задач. Через некоторое время после начала работы по карточкам канбан становится видно, сколько времени занимает выполнение разных задач. Эта информация помогает оптимизировать производственный процесс. Например, стало понятно, что на этапе тестирования скапливается слишком много карточек. Чтобы решить эту проблему, компания увеличивает штат тестировщиков или меняет принципы их работы.</p>

<h2>Практический пример применения доски канбан</h2>

<p>Для описания примера работы метода канбан возьмем производственную линию на автомобильном заводе. Работник А, отвечающий за установку дверей, знает количество необходимых деталей &mdash; восемь дверей на две машины. Зная примерное время производства дверей он может дать задачу в канбан доску для работника Б, который занимается производством дверей. Таким образом, когда работник А закончит устанавливать двери, работник Б подготовит для него необходимое количество новых деталей.</p>

<p>Менеджер, управляющий производственным процессом, видит общую картину и оценивает эффективность производственного процесса. Он может оценить изъяны производства и оперативно исправить их. Например, увеличить количество работников на разных линиях. Если производство работает правильно, не возникает простоев и скопления лишних деталей. Продукт выпускается вовремя.</p>

<h2>Канбан как элемент бережливого производства</h2>

<p>При такой схеме каждый человек знает, какое количество продукта и за какое время он должен поставить. Поэтому компания избавляется от необходимости выпускать огромное количество продукта и хранить его на складах. Если одна из деталей будет выпущена с браком, то проблема будет сразу же выявлена и устранена. Поэтому канбан обеспечивает бережливое производство и высокое качество продукта.</p>

<h2>Альтернативы системы канбан</h2>

<p>Одна из альтернативных систем канбан &mdash; эджайл. Принцип работы эджайл основан на итеративном подходе. То есть, работа разбивается на несколько этапов, пройти которые нужно за определенное количество времени.</p>

<p>При этом для каждой задачи прописывается приоритет. В отличие от канбан, главная метрика в эджайл &mdash; скорость работы команды. Задачи выполняются в формате спринтов, каждый из которых жестко ограничен по времени. Чем короче спринт, тем более гибким является производственный процесс.</p>

<p>Кроме канбан и эджайл, в производстве могут использоваться системы Lean, PRINCE2, Six Sigma и Scrum. Эффективность того или иного метода управления зависит от особенностей производства.</p>
<hr>

<h1>Методология Prince2 и её особенности</h1>
<p>Prince2 является главным стандартом проектного управления в Великобритании, также успешно применяемым в США, целом ряде европейских и других стран мира. Создавалась <em>Prince2 методология</em> государственными органами, однако до ума она была доведена уже представителями бизнеса. Среди плюсов Prince2 - гибкость, тщательный контроль и грамотное распределение обязанностей в команде, работающей над проектом.</p>
<h2>Управление проектами</h2>
<p>На любой проект возлагаются различные ожидания. Заказчик имеет четкое представление того, что должно получиться в итоге и на какую выгоду с этого он может рассчитывать, в то время как исполнитель думает о том, что ему придется осуществить. Также важно ожидание и потребителя, мнению которого нужно предвидеть &mdash; то, как он отреагирует на новую продукцию или внесение изменений в уже имеющийся на рынке товар.</p>
<p>Благодаря проектному комитету (ПК), являющимся управленческим органом в рассматриваемого метода, точки зрения заказчика, исполнителя и потребителя в совокупности формируют цельный треугольник. В ПК входит заказчик, а также старшие исполнитель и пользователь.</p>
<p>ПК подчиняется проектный менеджер (ПМ). Комитет проверяет соблюдение потребительских, исполнительских и коммерческих интересов на всех этапах, в то время как ресурсы и руководство передаются ПМ. Он начинает исполнять свои задачи после того, как будет утверждена внутренняя документация проекта.</p>
<h2>Устройство метода</h2>
<p>Стандарт включает в себя несколько процессов, компонентов и принципов, которые должны соответствовать ряду ограничений, а именно:</p>
<ul>
<li>временные рамки;</li>
<li>выгоды;</li>
<li>риски;</li>
<li>финансовые средства;</li>
<li>содержание проекта;</li>
<li>качество.</li>
</ul>
<h3>Компоненты</h3>
<ol>
<li>Обоснование проекта. Подразумевает обдумывание целесообразности запуска и методов его создания, анализ затрат, сроки осуществления и вероятные риски.</li>
<li>Организация. Менеджер проекта контролируется соответствующим комитетом, который, в свою очередь, предоставляет информацию корпоративному менеджменту.</li>
<li>Планы. Планирование осуществляется с учётом характеристик товара: цели создания, необходимые навыки и материалы. Благодаря этому исключается внесение срочных изменений.</li>
<li>Контроль. Проверяется соответствие проекта установленным критериям, расход финансов и времени согласно планам.</li>
<li>Управление рисками. Подразумевается проведение предварительного риск-анализа с целью исключения неприятных результатов.</li>
<li>Качество. Потребитель должны получить товар, соответствующий указанным характеристикам.</li>
<li>Изменения. Неизбежный аспект. В процессе может понадобиться увеличение ресурсов, изменение плана, организация слаженной работы и так далее.</li>
</ol>
<h3>Принципы</h3>
<ol>
<li>Проверка целесообразности проекта на каждом этапе.</li>
<li>Обучение на совершенных оплошностях.</li>
<li>Четко указание обязанностей и ролей.</li>
<li>Поэтапный менеджмент.</li>
<li>Управление по необходимости.</li>
<li>Внимание на продукте.</li>
<li>Гибкость.</li>
</ol>
<h3>Процессы</h3>
<ol>
<li>Начало, включающее в себя создание ПК.</li>
<li>Запуск. Комитет и менеджер занимаются подготовкой внутренней документации проекта, где в общих чертах фигурируют ключевые проектные детали.</li>
<li>Управление. Единственный из процессов, в котором напрямую задействован комитет. Остальные <em>процессы в Prince2</em> выполняет ПМ и подчиненные ему специалисты.</li>
<li>Контроль стадий. Менеджер, если нужно, вносит поправки в принимаемую работу, решает проблемы, либо информирует комитет об имеющихся препятствиях.</li>
<li>Руководство командой. Проектный менеджер раздает сотрудникам поручения, а также следит за выполнением поставленных задач.</li>
<li>Переход на следующий этап. Верифицируется соответствие осуществленного процесса плану и утверждается с ПК переход на другой уровень.</li>
<li>Закрытие проекта. Выполненная работа должна удовлетворять как заказчика, так и клиентов, а итоговый продукт можно было бы задействовать в коммерческих целях.</li>
</ol>
<h2>Литература</h2>
<p><em>PRINCE2 Study Guide </em></p>
<p>Автором книги является квалифицированный тренер Дэвид Хинде. С его помощью множество начинающих специалистов смогли подготовиться к сдаче сертификации по стандарту и сделали они это более чем успешно. Содержание данной <em>книги для изучения PRINCE2</em> - подробное описание данного метода и ряд примеров из опыта ведения бизнеса, неоднократно проверенных на практике.</p>
<p><em>Passing the PRINCE2 Exams For Dummies </em></p>
<p>Данная работа про <em>Prince2 управление проектами</em> была написана Ником Грэмом - главой компании, решившим поделиться своим профессиональным опытом в данном деле. В данном руководстве всё подаётся простым языком и делается акцент на каждом касающемся метода аспекте, даже на первый взгляд не особо значимом.</p>
<p><em>Prince2: A Practical Handbook </em></p>
<p>В данной книге от экзаменатора Prince2 объясняется, каким образом использовать принципы метода для хорошего старта проекта без выхода за ограничения. Также приведено несколько примеров и сценариев из жизни.</p>
<hr>
<h1>Agile</h1>


<h2> Что такое Agile методология</h2>
<p> Эффективная Agile методология управления - основывающийся на первостепенных ценностях подход эффективного управления проектами. Принципы по которым руководители проектов выполняют высокоприоритетную и качественную работу. Это трудолюбивый, дорогостоящий и подверженный ошибкам Agile подход к управлению проектами, который в течение десятилетия давал положительные результаты.</p>
<p> Agile ,гибкость дословно, предполагает способность непринужденно и молниеносно меняться, Agile управление проектами позволяет грамотно выделить приоритеты. Независимо от сферы применения техника воплощает выработанные цели быстро и в срок.</p>
<p> В стадии разработки программные проекты подвергаются изменениям и коррекции. Заказчики должны доработать и протестировать продукт вовремя, чтоб дополнительные затраты и задержки не погубили идею преждевременно. Методология Agile - это принятие изменений даже на поздней стадии разработки. Речь идет о предоставлении функций с первоочередной ценностью для бизнеса и наличии информации в сиюминутном времени для точного управления затратами, сроками, областью применения.</p>
<p> Гибкое управление Agile разделяет обязанности по проекту между тройкой гибких групп:</p>
<ol>
<li>Владелец идеи и спонсор отвечают за подачу целей проекта. Согласовывают соотношения графика и объема, адаптацию к изменчивости и устанавливают приоритеты для характеристик продукта.</li>
<li>ScrumMaster отвечающий за результат доводит до команды расстановку приоритетов для своих задач и удаляет препятствия для выполнению их задач.</li>
<li>Команда выполняет большую часть задач, ежедневно предоставляет отчеты о продвижении работы и контролирует качество продукта.</li>
</ol>
<h2>Agile-метод: Scrum</h2>
<p> Один из методов Agile - Scrum, предполагает не линейную разработку проекта, а реализацию готовыми к выпуску частями, завершенными за короткую (1-8 недель) итерацию, или спринт. Метод универсальный, легко применимый в любой сфере и на бытовом уровне Agile жизни. Чаще применяется в мире IT.</p>
<p> Основные принципы Scrum:</p>
<ul>
<li>Рабочие задачи делятся итерационно на части, названные спринтами, и временные рамки 1-8 недель.</li>
<li>Каждый спринт планирует Agile команда в соответствии и требованиями временного этапа. Ежедневно краткое обсуждение.</li>
<li>Итоговый командный анализ, обзор спринта, для выявления и улучшения слабых моментов.</li>
<li>Получение и внедрение обратной связи по результату.</li>
<li>Спринты равновременные.</li>
</ul>
<p> Команда Scrum выделяется гибкостью и разношерстностью. Каждый представитель умеет выполнять функции остальных членов группы.</p>
<h2>Agile-метод: Канбан</h2>
<p> Kanban - наглядный способ абсолютного управления рабочим процессом. Это всеобъемлющий процесс, вызванный помочь командам работать слаженно и результативно.</p>
<p> Kanban возвышается на 3 твердых принципах.</p>
<ol>
<li>Четкая визуализация рабочего процесса на день. Просмотр элементов во взаимосвязи. Используется доска и стикеры.</li>
<li>Ограничение ежедневного объема незавершенной работы. Чтоб команды не приступали к выполнению многочисленного количества задач параллельно. Это помогает сбалансировано отрегулировать полный процесс.</li>
<li>Расширение потока. После завершения задания команда приступает к следующему элементу с первостепенным приоритетом из невыполненных работ.</li>
</ol>
<p> Kanban способствует непрерывной взаимосвязи и сотрудничеству. Метод призывает к безостановочному обучению и совершенствованию. Техника работает благодаря выявлению наилучшего командного рабочего процесса.</p>
<h2> Как устроен проект в системе Agile</h2>
<p> Относительно разрабатываемого проекта метод Agile имеет четкое видение. Согласно которому после каждого, соответственно и первого, спринта проект должен быть:</p>
<ul>
<li>Стопроцентно работоспособным.</li>
<li>Полезным для целевого пользователя.</li>
<li>Усовершенствованным по сравнению с итогами прошлого спринта.</li>
</ul>
<p> Уже первые недели разработки проекта обязуются предоставить продукт минимально работоспособный, готовый к выпуску на рынок, хоть и с минимумом функций. Его выход - перво задачный этап проекта. Минимальный продукт способен сразу дать ответ относительно жизнеспособности и привлекательности для потребителя.</p>
<h2> Как устроена команда в системе Agile</h2>
<p> Демократия первостепенна, команда Agile работает как пожелает. Людей извне такая свобода и вседозволенность внутри коллектива удивляет. Философия гибкости предполагает, что команда - самоорганизованная целостность. Внутри спринта никто не ограничивает и не указывает как выполнять поставленные задачи, главное - результат. По завершению спринта группа анализирует насколько работа прошла результативно, это называется ретроспективой.</p>
<p> Как единая единица, команда не делится условно на конкретных членов, ответственность возлагается поровну. Если группа справилась - бонус, а если нет - штраф. Рабочий процесс проходит в одном кабинете, без секторов и разделений. Члени команды беспрепятственно общаются и обсуждают детали.</p>
<h2> Что такое Agile-манифест</h2>
<p> В 2001 году практиками лучших методов программирования был создан Agile-манифест. Договор объединяющий фундаментальные 4 ценности и 12 принципов гибкого проектирования ПО.</p>
<p> Фундаментальные ценности Agile-манифеста:</p>
<ol>
<li>Люди и взаимосвязывающие действия важнее процедуры и инструментов. На первое место ставится командная игра, как единое. Совместная работа, настроенная на единую цель, отличается потенциалом и лидирует в достижении успеха. За неудачу соответственно отвечает каждый. Главенствующий принцип - легкое, не обременяющее общение и совместные обсуждения.</li>
<li>Функционирующий продукт приоритетнее стопроцентной документации. Ударение ставится на взаимосвязь в команде, визуализацию процедуры разработки. Используются вертикальные доски с цветными карточками, соответствующими конкретной задаче. Значимость подробной документации занижена и стоит на второстепенных ролях.</li>
<li>Сотрудничество и взаимопонимание с непосредственным заказчиком приоритетнее гранитных условий контракта. Удачное завершение работы предполагает постоянное общение с заказчиком. Обратная связь дает понимание необходимого клиенту продукта.</li>
<li>Готовность к неизбежному внесению изменений важнее строгого протекания первоначального плана. Умение молниеносно реагировать на результат обратной связи и своевременное внесение изменений быстро совершенствует продукт.</li>
</ol>
<h2> Принципы Agile-манифеста</h2>
<p> Основываясь на ценностях выделяют и основообразующие принципы.</p>
<ol>
<li>Главная задача - удовлетворение требований и желаний заказчика. За счет предоставление проекта регулярно и как можно раньше.</li>
<li>Независимо от стадии проектирования изменения возможны. За счет Agile техники заказчик может внести изменения для конкурентоспособности проекта.</li>
<li>Регулярно, раз в 2 недели, максимум 2 месяца, выпускается работоспособный проект.</li>
<li>Изо дня в день разработчики контактируют с заказчиком.</li>
<li>Только мотивированные члены команды. Для плодоносной работы важны условия, поддержка и стопроцентное доверие.</li>
<li>Прямое общение - практичный и результативный способ обмена информации.</li>
<li>Работоспособный продукт - подтверждает прогресс.</li>
<li>Личности соприкасающиеся с проектом обязаны работать в одном, устойчивом ритме бесконечно. Это возможно если применять планирование Agile в каждой структуре.</li>
<li>Гибкость повышается за счет безостановочного внимания к технической стороне и идеальному качеству проектирования.</li>
<li>Минимизация лишних действий.</li>
<li>Самоорганизующиеся команды предоставляют призовые результаты.</li>
<li>Команда самолично подвергает результат работы критике, анализу и совершенствованию.</li>
</ol>
<h2> Книги по изучению Agile</h2>
<p> Для самостоятельного изучения или ознакомления с техникой и мышлением Agile ежегодно печатаются масса книг. Лучшие издания в 2019 году:</p>
<ul>
<li>Джон Уиллис, Джин Ким, Хамбл Джез и Патрик Дебуа создали бестселлер &ldquo;Руководство по DevOps&rdquo;;</li>
<li>Стивен Даннинг с изданием &ldquo;Эпоха Agile&rdquo;;</li>
<li>Лисса Адкинс порадовала &ldquo;Коучингом Agile-команд&rdquo;;</li>
<li>А вот Катерина Ленгольд воплотила гибкость в повседневную жизнь с бестселлером &ldquo;Просто космос&rdquo;. </li>
</ul>
<h2> Применение Agile в повседневной жизни</h2>
<p> Гибкий метод запросто применяется в обыденной жизни. Поставленные цели не только на пятилетку, а и на 2 месяца легко выполняются по Agile-методу. Достаточно разделить процесс на этапы, спринты, и безоговорочно выполнять каждый отрез. А техника Канбан обеспечивает визуализацию и определение первоочередных задач на пути к личному успеху. </p>
<p> Способов достичь результата - сколько и людей. Не стоит ограничивать себя в поиске решения, нестандартный подход куда результативнее. Agile философия должна стать не просто ходом мысли, а и образом жизни.</p>
</div>
<?php include 'footer.php';?>