<div class="container">
    <h1 class="text-white mt-5">Жизнь проекта</h1>
    <p class="mt-3 mb-5 text-white">Всем привет! Меня зовут Дмитрий Ласковский. Я - основатель и идеолог системы
        управления Lusy. В данном разделе я буду рассказывать вам новости нашего проекта, писать отчеты о новых версиях
        продукта и приоткрывать дверку в мир нашей внутренней кухни.</p>

    <div class="card mb-3">
        <div class="card-body">
            <small class="text-secondary">31 мая 2019 года</small>
            <h4 class="mt-3 mb-3">Релиз? Нет!</h4>
            <p>Была цель сделать релиз 31 мая. Ради этой цели пришлось отложить множество идей и сосредоточиться на
                самом важном.</p>
            <p>Однако, даже это не помогло успеть к концу мая. Были разные причины - и длительные майские праздники, и
                действительно большое количество задач, и просто "жизнь", как фактор, который всегда нужно
                учитывать.</p>
            <img class="card mb-3" src="/public/images/lusy-reg.jpg">
            <p>Но удалось сделать одну важную вещь - с 29 мая мы сами начали работать в системе. Я перенес все задачи из
                листочков, заметок, блокнотов и головы - в систему. Это было потрясающее облегчение. Я почувстовал, как
                теперь могу думать о будущем проекта, а не держать в голове сегодняшнюю рутину.</p>
        </div>
    </div>

    <div class="card mb-3">
        <div class="card-body">
            <small class="text-secondary">2 апреля 2019 года</small>
            <h4 class="mt-3 mb-3">Alpha-версия. Переезд в офис. Команда.</h4>
            <p>После двух месяцев скитаний по ресторанам и коворкингам с ноутбуком, я понял, что пора подключать
                команду.</p>
            <p>Изначально, я был крайне оптимистично настроен на счет сроков. Мне казалось, что основной функционал я
                самостоятельно смогу разработать за месяц и потрачу еще месяц на полировку и доработку.</p>
            <p>В итоге, это скатилось в удушающую рутину и фрустрацию. Я принял решение снять небольшой офис и нанять
                2-х специалистов - frontend и backend.</p>
            <img class="card mb-3" src="/public/images/lusy-alpha-version.jpg">
            <p>Продукт к тому времени оброс фишками и наработками, которые позже переродились в ту систему, который вы
                пользуетесь. И я, надеюсь, с удовольствием :-)</p>
            <p>Мне удалось привлечь к работе двух начинающих спецов, плюс на аутсорсе появился ui-дизайнер. И мы стали
                планомерно двигаться к релизу 31 мая...</p>
        </div>
    </div>

    <div class="card mb-3">
        <div class="card-body">
            <small class="text-secondary">17 января 2019 года</small>
            <h4 class="mt-3 mb-3">Начало разработки</h4>
            <p>В начале я разрабатывал проект один. Несколько дней ушло на разработку первого прототипа.</p>
            <p>В качестве технологий были взяты распространенные php 7.2 + jquery. В первые дни я набросал перечень
                функционала для MVP, сделал верстку на bootstrap, написал авторизацию и регистрацию, сделал постановку
                задач.</p>
            <p>В итоге рабочий стол выглядел так:</p>
            <img class="card mb-3" src="/public/images/lusy-first-version.jpg" title="Первая версия интерфейса Lusy">
            <p>Не смотря на то, что сам функционал постановки задач довольно простой (программисты поймут: добавить одну
                строку в бд - правда ведь несложное дело?), впереди предстояла большая работа.</p>
        </div>
    </div>

    <div class="card mb-3">
        <div class="card-body">
            <small class="text-secondary">8 сентября 2018 года</small>
            <h4 class="mt-3 mb-3">Идея, порадившая путь.</h4>
            <p>Сложно найти первую отправную точку, но порывшись в заметках на айфоне, я нашел первое упоминание Люси
                именно 8 сентября 2018 года.</p>
            <img class="card float-left mr-3 mb-3" src="/public/images/lusy-first-letter.jpg">
            <p>Идея родилась не на пустом месте. Уже тогда больше года я разрабатывал подобную систему для одной
                производственной компании, занимающейся переработкой.</p>
            <p>В компании было 100 сотрудников, производство, работающее 24/7, планы, 3 смены, 3 весовых терминала, 4 1с
                и т.д.</p>
            <p>Появилась амбициозная идея дать возможность собственнику в режиме онлайн и на одном экране телефона
                видеть все основные данные, которые необходимы для принятия управленческих решений.</p>
            <p>В конечном счете удалось оцифровать весь бумажный учет, автоматизировать постановку планов для смен,
                вести ежеминутный анализ и прогнозирование темпов производства, подключить 1с и в удобном виде
                отображать информацию по финансам, подключить и объединить три 1с с весовых терминалов в единый реестр
                взвешиваний + на основе этого разработать систему отчетности.</p>
            <p>В какой-то момент стало понятно, что продукт хоть и является штучным, но имеет за собой неплохую идею,
                которая может быть применима и к другим компаниям.</p>
            <p>Так родилась идея сделать унифицированный сервис по постановке и контролю задач, который будет иметь под
                собой модульную и гибкую платформу с возможность в кратчайшие сроки и за небольшие деньги интегрировать
                в систему все, что пожелает заказчик.</p>
        </div>
    </div>

</div>
